In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Kolkata.csv')

In [3]:
df.head()

,Price,Area,Location,No. of Bedrooms,Resale,MaintenanceStaff,Gymnasium,SwimmingPool,LandscapedGardens,JoggingTrack,...,LiftAvailable,BED,VaastuCompliant,Microwave,GolfCourse,TV,DiningTable,Sofa,Wardrobe,Refrigerator
0,2235000,1016,Barasat,3,0,0,1,1,1,1,...,1,0,0,0,0,0,0,0,0,0
1,3665999,1111,Keshtopur,2,0,1,1,0,1,1,...,0,0,0,0,0,0,0,0,0,0
2,3774000,1020,Rajarhat,2,0,0,1,0,0,0,...,1,0,0,0,0,0,0,0,0,0
3,2524000,935,Narendrapur,2,0,0,1,1,1,1,...,0,0,0,0,0,0,0,0,0,0
4,8300000,1956,New Town,3,1,0,1,1,1,1,...,1,0,1,0,0,0,0,0,0,0

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6507 entries, 0 to 6506
Data columns (total 40 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Price                6507 non-null   int64
 1   Area                 6507 non-null   int64
 2   Location             6507 non-null   object
 3   No. of Bedrooms      6507 non-null   int64
 4   Resale               6507 non-null   int64
 5   MaintenanceStaff     6507 non-null   int64
 6   Gymnasium            6507 non-null   int64
 7   SwimmingPool         6507 non-null   int64
 8   LandscapedGardens    6507 non-null   int64
 9   JoggingTrack         6507 non-null   int64
 10  RainWaterHarvesting  6507 non-null   int64
 11  IndoorGames          6507 non-null   int64
 12  ShoppingMall         6507 non-null   int64
 13  Intercom             6507 non-null   int64
 14  SportsFacility       6507 non-null   int64
 15  ATM                  6507 non-null   int64
 16  ClubHouse            6507 non-null   int64
 17  School               6507 non-null   int64
 18  24X7Security         6507 non-null   int64
 19  PowerBackup          6507 non-null   int64
 20  CarParking           6507 non-null   int64
 21  StaffQuarter         6507 non-null   int64
 22  Cafeteria            6507 non-null   int64
 23  MultipurposeRoom     6507 non-null   int64
 24  Hospital             6507 non-null   int64
 25  WashingMachine       6507 non-null   int64
 26  Gasconnection        6507 non-null   int64
 27  AC                   6507 non-null   int64
 28  Wifi                 6507 non-null   int64
 29  Children'splayarea   6507 non-null   int64
 30  LiftAvailable        6507 non-null   int64
 31  BED                  6507 non-null   int64
 32  VaastuCompliant      6507 non-null   int64
 33  Microwave            6507 non-null   int64
 34  GolfCourse           6507 non-null   int64
 35  TV                   6507 non-null   int64
 36  DiningTable          6507 non-null   int64
 37  Sofa                 6507 non-null   int64
 38  Wardrobe             6507 non-null   int64
 39  Refrigerator         6507 non-null   int64
dtypes: int64(39), object(1)
memory usage: 2.0+ MB

In [5]:
filtered_df = df[df['No. of Bedrooms'] == 2]

In [6]:
filtered_df.shape

(2622, 40)

In [7]:
unique_locations = df['Location'].unique()

In [8]:
unique_locations.shape

(308,)

In [9]:
grouped_df = df.groupby('Location').mean()[['Price', 'Area']]

In [10]:
grouped_df['price_per_sqft'] = grouped_df['Price'] / grouped_df['Area']

In [11]:
grouped_df.shape

(308, 3)

In [12]:
grouped_df.head()

                                        Price    Area  price_per_sqft
Location
Acharya Jagadish Chandra Bose Road  6000000.0   850.0     7058.823529
Action Area I                       3825000.0  1216.0     3145.559211
Action Area I Newtown               4152875.0  1358.0     3058.081738
Action Area II Newtown              9655500.0  1551.0     6225.338491
Action Area IIB Newtown             7445000.0  1450.0     5134.482759

In [13]:
grouped_df = grouped_df.sort_values(by='price_per_sqft', ascending=True)

In [14]:
grouped_df.head()

                     Price         Area  price_per_sqft
Location
Sarat Bose Road  2431000.0  5000.000000      486.200000
C R Avenue       2200000.0  2000.000000     1100.000000
Kayastopara      2100000.0  1530.000000     1372.549020
Sodepur Road     2160000.0  1485.000000     1454.545455
Newtown AA III   2809000.0  1842.333333     1524.696942

In [15]:
grouped_df.to_csv('ranking.csv', index=True)